
## Terraform Plan of GCP
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.google_iam_policy.igsr5_daily_cloud_run: Reading...
google_service_account.igsr5_daily_sa: Refreshing state... [id=projects/igsr5-368506/serviceAccounts/cloud-run-invoker-sa-i-d@igsr5-368506.iam.gserviceaccount.com]
google_secret_manager_secret.github_project_automation_prototype_gh_token: Refreshing state... [id=projects/igsr5-368506/secrets/github-project-automation-prototype-gh-token]
google_service_account.github_project_automation_prototype_sa: Refreshing state... [id=projects/igsr5-368506/serviceAccounts/cloud-run-invoker-sa-g-p-a-p@igsr5-368506.iam.gserviceaccount.com]
google_secret_manager_secret.igsr5-daily_slack_admin_user_id: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-admin-user-id]
google_secret_manager_secret.igsr5-daily_slack_webhook_url: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-webhook-url]
data.google_iam_policy.github_project_automation_prototype_cloud_run: Reading...
data.google_iam_policy.igsr5_daily_cloud_run: Read complete after 0s [id=3818910945]
google_secret_manager_secret.igsr5_daily_database_url: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--database-url]
google_service_account.attendance_request_scheduler_sa: Refreshing state... [id=projects/igsr5-368506/serviceAccounts/cloud-run-invoker-sa-a-r-s@igsr5-368506.iam.gserviceaccount.com]
google_secret_manager_secret.igsr5-daily_slack_signing_secret: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-signing-secret]
data.google_iam_policy.github_project_automation_prototype_cloud_run: Read complete after 0s [id=3818910945]
google_secret_manager_secret.igsr5_daily_slack_bot_token: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-bot-token]
google_cloud_run_service.github_project_automation_prototype: Refreshing state... [id=locations/asia-northeast1/namespaces/igsr5-368506/services/github-project-automation-prototype]
google_cloud_run_service.attendance_request_bot: Refreshing state... [id=locations/asia-northeast1/namespaces/igsr5-368506/services/attendance-request-bot]
google_cloud_run_service.igsr5_daily: Refreshing state... [id=locations/asia-northeast1/namespaces/igsr5-368506/services/igsr5-daily]
google_secret_manager_secret_iam_policy.igsr5_daily_slack_webhook_url: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-webhook-url]
google_secret_manager_secret_iam_policy.igsr5_daily_slack_bot_token: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-bot-token]
data.google_iam_policy.github_project_automation_prototype_invoker: Reading...
data.google_iam_policy.github_project_automation_prototype_invoker: Read complete after 0s [id=2575965494]
data.google_iam_policy.igsr5_daily_invoker: Reading...
data.google_iam_policy.igsr5_daily_invoker: Read complete after 0s [id=1740922505]
data.google_iam_policy.attendance_request_scheduler_sa_invoker: Reading...
data.google_iam_policy.attendance_request_scheduler_sa_invoker: Read complete after 0s [id=2608228920]
google_secret_manager_secret_iam_policy.github_project_automation_prototype_gh_token: Refreshing state... [id=projects/igsr5-368506/secrets/github-project-automation-prototype-gh-token]
google_secret_manager_secret_iam_policy.igsr5_daily_slack_admin_user_id: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-admin-user-id]
google_secret_manager_secret_iam_policy.igsr5_daily_database_url: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--database-url]
google_secret_manager_secret_iam_policy.igsr5_daily_slack_signing_secret: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-signing-secret]
google_cloud_run_service_iam_policy.github_project_automation_prototype_sa_policy: Refreshing state... [id=v1/projects/igsr5-368506/locations/asia-northeast1/services/github-project-automation-prototype]
google_cloud_scheduler_job.github_project_automation_prototype_pull_requests: Refreshing state... [id=projects/igsr5-368506/locations/asia-northeast1/jobs/github-project-automation-prototype-pull-requests]
google_cloud_scheduler_job.github_project_automation_prototype_review_pull_requests: Refreshing state... [id=projects/igsr5-368506/locations/asia-northeast1/jobs/github-project-automation-prototype-review-pull-requests]
google_cloud_scheduler_job.github_project_automation_prototype_issues: Refreshing state... [id=projects/igsr5-368506/locations/asia-northeast1/jobs/github-project-automation-prototype-issues]
google_cloud_run_service_iam_policy.attendance_request_scheduler_sa_policy: Refreshing state... [id=v1/projects/igsr5-368506/locations/asia-northeast1/services/attendance-request-bot]
google_cloud_run_service_iam_policy.igsr5_daily_sa_policy: Refreshing state... [id=v1/projects/igsr5-368506/locations/asia-northeast1/services/igsr5-daily]
google_cloud_scheduler_job.igsr5_daily: Refreshing state... [id=projects/igsr5-368506/locations/asia-northeast1/jobs/igsr5-daily]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_scheduler_job.github_project_automation_prototype_issues will be created
  + resource "google_cloud_scheduler_job" "github_project_automation_prototype_issues" {
      + attempt_deadline = "600s"
      + id               = (known after apply)
      + name             = "github-project-automation-prototype-issues"
      + paused           = (known after apply)
      + project          = (known after apply)
      + region           = (known after apply)
      + schedule         = "*/5 * * * 1-5"
      + state            = (known after apply)
      + time_zone        = "Asia/Tokyo"

      + http_target {
          + http_method = "POST"
          + uri         = "https://github-project-automation-prototype-ibzykqu2gq-an.a.run.app/issues"

          + oidc_token {
              + audience              = "https://github-project-automation-prototype-ibzykqu2gq-an.a.run.app"
              + service_account_email = "cloud-run-invoker-sa-g-p-a-p@igsr5-368506.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

  # google_cloud_scheduler_job.github_project_automation_prototype_pull_requests will be created
  + resource "google_cloud_scheduler_job" "github_project_automation_prototype_pull_requests" {
      + attempt_deadline = "600s"
      + id               = (known after apply)
      + name             = "github-project-automation-prototype-pull-requests"
      + paused           = (known after apply)
      + project          = (known after apply)
      + region           = (known after apply)
      + schedule         = "*/3 * * * 1-5"
      + state            = (known after apply)
      + time_zone        = "Asia/Tokyo"

      + http_target {
          + http_method = "POST"
          + uri         = "https://github-project-automation-prototype-ibzykqu2gq-an.a.run.app/pull_requests"

          + oidc_token {
              + audience              = "https://github-project-automation-prototype-ibzykqu2gq-an.a.run.app"
              + service_account_email = "cloud-run-invoker-sa-g-p-a-p@igsr5-368506.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`*